BUHTOOLS/src/DataProcessors/ДанныеПосредников/ДанныеПосредников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДанныеПосредников</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеПосредников</name>
    <attributes>
      <name>КодПосредника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Посредник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сервис</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВознаграждениеUFS</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

BUHTOOLS/src/DataProcessors/ДанныеПосредников/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеЗаПериод(Команда)
	
	Объект.ДанныеПосредников.Очистить();
	
	Если ПроверитьЗаполнение() Тогда
		ПолучитьДанныеЗаПериодНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеЗаПериодНаСервере()
	
	СтруктураДанных = Новый Структура();
	
	СтруктураДанных.Вставить("ДатаНачала",Объект.ДатаНачала);
	
	СтруктураДанных.Вставить("ДатаОкончания",Объект.ДатаОкончания);
	
	АдресВХранидище = ПоместитьВоВременноеХранилище(СтруктураДанных,УникальныйИдентификатор);
	
    Обработки.ДанныеПосредников.ПолучитьДанныеПровайдеровЗаПериод(АдресВХранидище);
	
	СтруктураСДанными = ПолучитьИзВременногоХранилища(АдресВХранидище);
	
	ДанныеДляЗагрузки = Новый ТаблицаЗначений();
	
	СтруктураСДанными.Свойство("Данные",ДанныеДляЗагрузки);
	
	Объект.ДанныеПосредников.Загрузить(ДанныеДляЗагрузки);
	
КонецПроцедуры
